app/views/posts/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
---
  <tr>
	<td><%= User.find(post.user).nick %></td>