app/views/posts/show.html.erb

<h2><%= @post.title %></h2>
<h5>- by <%= User.find(@post.user).nick %></h5>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1


<% @post.comments.each do |c| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 1