app/controllers/comments_controller.rb

  def create
	if not current_user then redirect_to "/"and return end
	@post = Post.find(params[:post_id])
    @comment =  @post.comments.create!(params[:comment])
	@comment.user = User.find(current_user)

    respond_to do |format|
      if @comment.save
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "First Comment"], ["created_at", Tue, 09 Oct 2012 14:11:53 UTC +00:00], ["post_id", 2], ["updated_at", Tue, 09 Oct 2012 14:11:53 UTC +00:00], ["user_id", nil]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
UPDATE "comments" SET "user_id" = 2, "updated_at" = '2012-10-09 14:11:53.332125' WHERE "comments"."id" = 1