app/controllers/posts_controller.rb

  def edit
	if not current_admin then redirect_to "/"and return end
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]

  def create
	if not current_admin then redirect_to "/"and return end
    @post = Post.new(params[:post])
	@post.user = User.find(current_user)

    respond_to do |format|
      if @post.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
INSERT INTO "posts" ("body", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["body", "a"], ["created_at", Tue, 09 Oct 2012 11:15:32 UTC +00:00], ["title", "First Post"], ["updated_at", Tue, 09 Oct 2012 11:15:32 UTC +00:00], ["user_id", 2]]

  def update
	if not current_admin then redirect_to "/"and return end
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "posts" SET "body" = 'But I must explain to you how all this mistaken idea of denouncing pleasure and praising pain was born and I will give you a complete account of the system, and expound the actual teachings of the great explorer of the truth, the master-builder of human happiness. No one rejects, dislikes, or avoids pleasure itself, because it is pleasure, but because those who do not know how to pursue pleasure rationally encounter consequences that are extremely painful. Nor again is there anyone who loves or pursues or desires to obtain pain of itself, because it is pain, but because occasionally circumstances occur in which toil and pain can procure him some great pleasure. To take a trivial example, which of us ever undertakes laborious physical exercise, except to obtain some advantage from it? But who has any right to find fault with a man who chooses to enjoy a pleasure that has no annoying consequences, or one who avoids a pain that produces no resultant pleasure?', "updated_at" = '2012-10-09 20:59:02.531580' WHERE "posts"."id" = 2

  def destroy
	if not current_admin then redirect_to "/"and return end
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]