app/controllers/users_controller.rb

INSERT INTO "users" ("admin", "created_at", "crypted_password", "nick", "password_salt", "persistence_token", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
	@user.admin = false if @user.admin == nil
	@user.admin = true if @user.nick == 'admin'

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "nick" = 'adminX', "password_salt" = 'i080wYkNbfxAfGokpa', "crypted_password" = 'b2d4dab342f0e3551437c04c5cea678bd10df2c3d6ef50b11d967ef0744b5bdda7ccc0e6f152bedd4d59fca3a72d8a67b5a74842ca21de8c8ac310c3dce17687', "persistence_token" = '914feda764ef88ee3f02820f34360d3aa7af0fd9819326b5cf308a757fe370f3decf11409e75d87fec2a7c8512849a632d3e0a90b575a63b90594fc098dbf022', "updated_at" = '2012-10-22 13:10:07.519004' WHERE "users"."id" = 5
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])